app/Http/Controllers/PatientreportController.php

    public function index(Request $request)
    {
        /** @var Patientreport $patientreports */
        $patientreports = Patientreport::paginate(10);
---
select * from `patientreports` limit 10 offset 0
select count(*) as aggregate from `patientreports`